Shaopus/esp32-homekit-weather-station-bme280/components/i2c_devices/sensor/lis2dh12/include/iot_lis2dh12.h
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at

//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#ifndef _IOT_LIS2DH12_H_
#define _IOT_LIS2DH12_H_

#include "driver/i2c.h"
#include "iot_i2c_bus.h"
#ifdef __cplusplus
extern "C" {
#endif

#define WRITE_BIT      I2C_MASTER_WRITE  /*!< I2C master write */
#define READ_BIT       I2C_MASTER_READ   /*!< I2C master read */
#define ACK_CHECK_EN   0x1               /*!< I2C master will check ack from slave*/
#define ACK_CHECK_DIS  0x0               /*!< I2C master will not check ack from slave */
#define ACK_VAL        0x0               /*!< I2C ack value */
#define NACK_VAL       0x1               /*!< I2C nack value */

/**
* @brief  State enable
*/
typedef enum {
    LIS2DH12_DISABLE = 0,
    LIS2DH12_ENABLE,
} lis2dh12_state_t; 

/**
* @brief  Bit status
*/
typedef enum {
    LIS2DH12_RESET = 0,
    LIS2DH12_SET,
} lis2dh12_bit_status_t; 

/**
* @brief Temperature sensor enable
*/
typedef enum {
    LIS2DH12_TEMP_DISABLE   = 0x00,   /*!< Temperature sensor disable*/
    LIS2DH12_TEMP_ENABLE    = 0x03    /*!< Temperature sensor enable */
}lis2dh12_temp_en_t;

/**
* @brief  Output data rate configuration
*/
typedef enum {   
    LIS2DH12_OPT_NORMAL        = 0x00,         /*!< Normal mode */
    LIS2DH12_OPT_HIGH_RES      = 0x01,         /*!<  High resolution */
    LIS2DH12_OPT_LOW_POWER     = 0x02,         /*!< low power mode */
} lis2dh12_opt_mode_t;

/**
* @brief  Output data rate configuration
*/
typedef enum {   
    LIS2DH12_ODR_LOW_POWER   = 0x00,       /*!< Power-down mode */
    LIS2DH12_ODR_1HZ         = 0x01,       /*!< HR / Normal / Low-power mode (1 Hz) */
    LIS2DH12_ODR_10HZ        = 0x02,       /*!< HR / Normal / Low-power mode (10 Hz) */
    LIS2DH12_ODR_25HZ        = 0x03,       /*!< HR / Normal / Low-power mode (25 Hz) */
    LIS2DH12_ODR_50HZ        = 0x04,       /*!< HR / Normal / Low-power mode (50 Hz) */
    LIS2DH12_ODR_100HZ       = 0x05,       /*!< HR / Normal / Low-power mode (100 Hz) */
    LIS2DH12_ODR_200HZ       = 0x06,       /*!< HR / Normal / Low-power mode (200 Hz) */
    LIS2DH12_ODR_400HZ       = 0x07,       /*!< HR/ Normal / Low-power mode (400 Hz) */
    LIS2DH12_ODR_1620HZ      = 0x08,       /*!< Low-power mode (1.620 kHz) */
    LIS2DH12_ODR_1344HZ      = 0x09,       /*!< HR/ Normal (1.344 kHz); Low-power mode (5.376 kHz) */
} lis2dh12_odr_t;

/**
* @brief  High-pass filter mode selection
*/
typedef enum {
    LIS2DH12_HPM_NORMAL_RESET    = 0x00,      /*!< Normal mode (reset by reading REFERENCE (26h) register) */
    LIS2DH12_HPM_REF_SIG_FILTER  = 0x01,      /*!< Reference signal for filtering */
    LIS2DH12_HPM_NORMAL_MODE     = 0x02,      /*!< Normal mode */
    LIS2DH12_HPM_AUTO_IA         = 0x03,      /*!< Autoreset on interrupt event */
}lis2dh12_hpm_mode_t;

/**
* @brief  Full-scale selection
*/
typedef enum {
    LIS2DH12_FS_2G       = 0x00,    /*!< Full scale: +/-2g */
    LIS2DH12_FS_4G       = 0x01,    /*!< Full scale: +/-4g  */
    LIS2DH12_FS_8G       = 0x02,    /*!< Full scale: +/-8g  */
    LIS2DH12_FS_16G      = 0x03,    /*!< Full scale: +/-16g  */
}lis2dh12_fs_t;

/**
* @brief  Self-test mode selection
*/
typedef enum {
    LIS2DH12_ST_DISABLE     = 0x00,    /*!< Normal mode */
    LIS2DH12_ST_MODE0       = 0x01,    /*!< Self test 0  */
    LIS2DH12_ST_MODE1       = 0x02,    /*!< Self test 1  */
}lis2dh12_self_test_t;


/**
* @brief  LIS2DH12 Init structure definition. 
*/   
typedef struct
{
    lis2dh12_state_t      sdo_pu_disc;     /*!< Disconnect SDO/SA0 pull-up  */
    lis2dh12_temp_en_t    temp_enable;     /*!< Temperature sensor enable  */
    lis2dh12_odr_t        odr;             /*!< Data rate selection  */
    lis2dh12_opt_mode_t   opt_mode;        /*!< Operating mode selection  */
    lis2dh12_state_t      z_enable;        /*!< Z-axis enable  */
    lis2dh12_state_t      y_enable;        /*!< Y-axis enable  */
    lis2dh12_state_t      x_enable;        /*!< X-axis enable  */
    lis2dh12_hpm_mode_t   hmp_mode;        /*!< High-pass filter mode selection  */
    lis2dh12_state_t      fds;             /*!< Filtered data selection  */
    lis2dh12_state_t      bdu_status;      /*!< Block data update  */
    lis2dh12_state_t      ble_status;      /*!< Big/Little Endian data selection, can be activated only in high-resolution mode  */
    lis2dh12_fs_t         fs;              /*!< Full-scale selection  */
    lis2dh12_state_t      fifo_enable;     /*!< FIFO enable  */
}lis2dh12_config_t; 

/**
* @brief  Bitfield positioning.
*/
#define LIS2DH12_BIT(x)   (x)

/**
* @brief  I2C address.
*/
#define LIS2DH12_I2C_ADDRESS   0x18


/**
* @brief  Temperature data status register
*/
#define LIS2DH12_STATUS_REG_AUX_REG      0x07

#define LIS2DH12_TOR_BIT      LIS2DH12_BIT(6)
#define LIS2DH12_TDA_BIT      LIS2DH12_BIT(2)

#define LIS2DH12_TOR_MASK     0x40
#define LIS2DH12_TDA_MASK     0x04

/**
* @brief   Temperature data (LSB)
*/
#define LIS2DH12_OUT_TEMP_L_REG      0x0C

/**
* @brief   Temperature data (HSB)
*/
#define LIS2DH12_OUT_TEMP_H_REG      0x0D

/**
* @brief Device Identification register.
*/
#define LIS2DH12_WHO_AM_I_REG        0x0F

/**
* @brief Device Identification value.
*/
#define LIS2DH12_WHO_AM_I_VAL        0x33

/**
* @brief  Control register 0
*/
#define LIS2DH12_CTRL_REG0             0x1E
#define LIS2DH12_SDO_PDU_DISC_BIT      LIS2DH12_BIT(7)
#define LIS2DH12_SDO_PDU_DISC_MASK     0x80

/**
* @brief  Temperature config register
*/
#define LIS2DH12_TEMP_CFG_REG     0x1F
#define LIS2DH12_TEMP_EN_BIT      LIS2DH12_BIT(6)
#define LIS2DH12_TEMP_EN_MASK     0xC0

/**
* @brief  Control register 1
*/
#define LIS2DH12_CTRL_REG1        0x20

