Shaopus/esp32-homekit-weather-station-bme280/components/i2c_devices/sensor/lis2dh12/include/iot_lis2dh12.h
#define LIS2DH12_ODR_BIT          LIS2DH12_BIT(4)
#define LIS2DH12_LP_EN_BIT        LIS2DH12_BIT(3)
#define LIS2DH12_Z_EN_BIT         LIS2DH12_BIT(2)
#define LIS2DH12_Y_EN_BIT         LIS2DH12_BIT(1)
#define LIS2DH12_X_EN_BIT         LIS2DH12_BIT(0)

#define LIS2DH12_ODR_MASK         0xF0
#define LIS2DH12_LP_EN_MASK       0x08
#define LIS2DH12_Z_EN_MASK        0x04
#define LIS2DH12_Y_EN_MASK        0x02
#define LIS2DH12_X_EN_MASK        0x01

/**
* @brief  Control register 2
*/
#define LIS2DH12_CTRL_REG2         0x21

#define LIS2DH12_HMP_BIT           LIS2DH12_BIT(6)
#define LIS2DH12_HPCF_BIT          LIS2DH12_BIT(4)
#define LIS2DH12_FDS_BIT           LIS2DH12_BIT(3)
#define LIS2DH12_HPCLICK_BIT       LIS2DH12_BIT(2)
#define LIS2DH12_HP_IA2_BIT        LIS2DH12_BIT(1)
#define LIS2DH12_HP_IA1_BIT        LIS2DH12_BIT(0)

#define LIS2DH12_HMP_MASK          0xC0
#define LIS2DH12_HPCF_MASK         0x30
#define LIS2DH12_FDS_MASK          0x08
#define LIS2DH12_HPCLICK_MASK      0x04
#define LIS2DH12_HP_IA2_MASK       0x02
#define LIS2DH12_HP_IA1_MASK       0x01

/**
* @brief  Control register 3
*/
#define LIS2DH12_CTRL_REG3            0x22

#define LIS2DH12_I1_CLICK_BIT         LIS2DH12_BIT(7)
#define LIS2DH12_I1_IA1_BIT           LIS2DH12_BIT(6)
#define LIS2DH12_I1_IA2_BIT           LIS2DH12_BIT(5)
#define LIS2DH12_I1_ZYXDA_BIT         LIS2DH12_BIT(4)
#define LIS2DH12_I1_WTM_BIT           LIS2DH12_BIT(2)
#define LIS2DH12_I1_OVERRUAN_BIT      LIS2DH12_BIT(1)

#define LIS2DH12_I1_CLICK_MASK        0x80
#define LIS2DH12_I1_IA1_MASK          0x40
#define LIS2DH12_I1_IA2_MASK          0x20
#define LIS2DH12_I1_ZYXDA_MASK        0x10
#define LIS2DH12_I1_WTM_MASK          0x04
#define LIS2DH12_I1_OVERRUAN_MASK     0x02

/**
* @brief  Control register 4
*/
#define LIS2DH12_CTRL_REG4      0x23

#define LIS2DH12_BDU_BIT        LIS2DH12_BIT(7)
#define LIS2DH12_BLE_BIT        LIS2DH12_BIT(6)
#define LIS2DH12_FS_BIT         LIS2DH12_BIT(4)
#define LIS2DH12_HR_BIT         LIS2DH12_BIT(3)
#define LIS2DH12_ST_BIT         LIS2DH12_BIT(1)
#define LIS2DH12_SIM_BIT        LIS2DH12_BIT(0)

#define LIS2DH12_BDU_MASK       0x80
#define LIS2DH12_BLE_MASK       0x40
#define LIS2DH12_FS_MASK        0x30
#define LIS2DH12_HR_MASK        0x08
#define LIS2DH12_ST_MASK        0x06
#define LIS2DH12_SIM_MASK       0x01

/**
* @brief  Control register 5
*/
#define LIS2DH12_CTRL_REG5          0x24

#define LIS2DH12_BOOT_BIT           LIS2DH12_BIT(7)
#define LIS2DH12_FIFO_EN_BIT        LIS2DH12_BIT(6)
#define LIS2DH12_LIR_INT1_BIT       LIS2DH12_BIT(3)
#define LIS2DH12_D4D_INT1_BIT       LIS2DH12_BIT(2)
#define LIS2DH12_LIR_INT2_BIT       LIS2DH12_BIT(1)
#define LIS2DH12_D4D_INT2_BIT       LIS2DH12_BIT(0)

#define LIS2DH12_BOOT_MASK          0x80
#define LIS2DH12_FIFO_EN_MASK       0x40
#define LIS2DH12_LIR_INT1_MASK      0x08
#define LIS2DH12_D4D_INT1_MASK      0x04
#define LIS2DH12_LIR_INT2_MASK      0x02
#define LIS2DH12_D4D_INT2_MASK      0x01

/**
* @brief  Control register 6
*/
#define LIS2DH12_CTRL_REG6            0x25

#define LIS2DH12_I2_CLICK_BIT         LIS2DH12_BIT(7)
#define LIS2DH12_I2_IA1_BIT           LIS2DH12_BIT(6)
#define LIS2DH12_I2_IA2_BIT           LIS2DH12_BIT(5)
#define LIS2DH12_I2_BOOT_BIT          LIS2DH12_BIT(4)
#define LIS2DH12_I2_ACT_BIT           LIS2DH12_BIT(3)
#define LIS2DH12_I2_POLARITY_BIT      LIS2DH12_BIT(1)

#define LIS2DH12_I2_CLICK_MASK        0x80
#define LIS2DH12_I2_IA1_MASK          0x40
#define LIS2DH12_I2_IA2_MASK          0x20
#define LIS2DH12_I2_BOOT_MASK         0x10
#define LIS2DH12_I2_ACT_MASK          0x08
#define LIS2DH12_I2_POLARITY_MASK     0x02

/**
* @brief  Reference value register
*/
#define LIS2DH12_REFERENCE_REG        0x26

#define LIS2DH12_REFERENCE_BIT        LIS2DH12_BIT(0)

#define LIS2DH12_REFERENCE_MASK       0xFF

/**
* @brief  status register
*/
#define LIS2DH12_STATUS_REG      0x27

/**
* @brief  X-axis acceleration data(LSB)
*/
#define LIS2DH12_OUT_X_L_REG      0x28

/**
* @brief  X-axis acceleration data(MSB)
*/
#define LIS2DH12_OUT_X_H_REG      0x29

/**
* @brief  Y-axis acceleration data(LSB)
*/
#define LIS2DH12_OUT_Y_L_REG      0x2A

/**
* @brief  Y-axis acceleration data(MSB)
*/
#define LIS2DH12_OUT_Y_H_REG      0x2B

/**
* @brief  Z-axis acceleration data(LSB)
*/
#define LIS2DH12_OUT_Z_L_REG      0x2C

/**
* @brief  Z-axis acceleration data(MSB)
*/
#define LIS2DH12_OUT_Z_H_REG      0x2D

/**
* @brief  FIFO control register
*/
#define LIS2DH12_FIFO_CTRL_REG     0x2E
#define LIS2DH12_FM_BIT            LIS2DH12_BIT(6)
#define LIS2DH12_TR_BIT            LIS2DH12_BIT(5)
#define LIS2DH12_FTH_BIT           LIS2DH12_BIT(0)
#define LIS2DH12_FM_MASK           0xC0
#define LIS2DH12_TR_MASK           0x20
#define LIS2DH12_FTH_MASK          0x1F

/**
* @brief  FIFO source register
*/
#define LIS2DH12_FIFO_SRC_CTRL_REG  0x2F

#define LIS2DH12_WTM_BIT            LIS2DH12_BIT(7)
#define LIS2DH12_OVRN_FIFO_BIT      LIS2DH12_BIT(6)
#define LIS2DH12_EMPTY_BIT          LIS2DH12_BIT(5)
#define LIS2DH12_FSS_BIT            LIS2DH12_BIT(0)

#define LIS2DH12_WTM_MASK           0x80
#define LIS2DH12_OVRN_FIFO_MASK     0x40
#define LIS2DH12_EMPTY_MASK         0x20
#define LIS2DH12_FSS_MASK           0x1F

/**
* @brief  Interrupt 1 config register
*/
#define LIS2DH12_INT1_CFG_REG             0x30
#define LIS2DH12_INT1_AOI_BIT             LIS2DH12_BIT(7)
#define LIS2DH12_INT1_6D_BIT              LIS2DH12_BIT(6)
#define LIS2DH12_INT1_ZHIE_BIT            LIS2DH12_BIT(5)
#define LIS2DH12_INT1_ZLIE_BIT            LIS2DH12_BIT(4)
#define LIS2DH12_INT1_YHIE_BIT            LIS2DH12_BIT(3)
#define LIS2DH12_INT1_YLIE_BIT            LIS2DH12_BIT(2)
#define LIS2DH12_INT1_XHIE_BIT            LIS2DH12_BIT(1)
#define LIS2DH12_INT1_XLIE_BIT            LIS2DH12_BIT(0)
#define LIS2DH12_INT1_AOI_MASK            0x80
#define LIS2DH12_INT1_6D_MASK             0x40
#define LIS2DH12_INT1_ZHIE_MASK           0x20
#define LIS2DH12_INT1_ZLIE_MASK           0x10
#define LIS2DH12_INT1_YHIE_MASK           0x08
#define LIS2DH12_INT1_YLIE_MASK           0x04
#define LIS2DH12_INT1_XHIE_MASK           0x02
#define LIS2DH12_INT1_XLIE_MASK           0x01

/**
* @brief  Interrupt 1 source register
*/
#define LIS2DH12_INT1_SRC_REG           0x31
#define LIS2DH12_INT1_IA_BIT            LIS2DH12_BIT(6)
#define LIS2DH12_INT1_ZH_BIT            LIS2DH12_BIT(5)
#define LIS2DH12_INT1_ZL_BIT            LIS2DH12_BIT(4)
#define LIS2DH12_INT1_YH_BIT            LIS2DH12_BIT(3)
#define LIS2DH12_INT1_YL_BIT            LIS2DH12_BIT(2)
#define LIS2DH12_INT1_XH_BIT            LIS2DH12_BIT(1)
#define LIS2DH12_INT1_XL_BIT            LIS2DH12_BIT(0)
#define LIS2DH12_INT1_IA_MASK           0x40
#define LIS2DH12_INT1_ZH_MASK           0x20
#define LIS2DH12_INT1_ZL_MASK           0x10
#define LIS2DH12_INT1_YH_MASK           0x08
#define LIS2DH12_INT1_YL_MASK           0x04
#define LIS2DH12_INT1_XH_MASK           0x02
#define LIS2DH12_INT1_XL_MASK           0x01

/**
* @brief  Interrupt 1 threshold register
*/
#define LIS2DH12_INT1_THS_REG            0x32
#define LIS2DH12_INT1_THS_BIT            LIS2DH12_BIT(0)
#define LIS2DH12_INT1_THS_MASK           0x7F

/**
* @brief  Interrupt 1 duration register
*/
#define LIS2DH12_INT1_DURATION_REG        0x33
#define LIS2DH12_INT1_DURATION_BIT        LIS2DH12_BIT(0)
#define LIS2DH12_INT1_DURATION_MASK       0x7F

/**
* @brief  Interrupt 2 config register
*/
#define LIS2DH12_INT2_CFG_REG             0x34

