Shaopus/esp32-homekit-weather-station-bme280/components/i2c_devices/sensor/lis2dh12/include/iot_lis2dh12.h
#define LIS2DH12_INT2_AOI_BIT             LIS2DH12_BIT(7)
#define LIS2DH12_INT2_6D_BIT              LIS2DH12_BIT(6)
#define LIS2DH12_INT2_ZHIE_BIT            LIS2DH12_BIT(5)
#define LIS2DH12_INT2_ZLIE_BIT            LIS2DH12_BIT(4)
#define LIS2DH12_INT2_YHIE_BIT            LIS2DH12_BIT(3)
#define LIS2DH12_INT2_YLIE_BIT            LIS2DH12_BIT(2)
#define LIS2DH12_INT2_XHIE_BIT            LIS2DH12_BIT(1)
#define LIS2DH12_INT2_XLIE_BIT            LIS2DH12_BIT(0)

#define LIS2DH12_INT2_AOI_MASK            0x80
#define LIS2DH12_INT2_6D_MASK             0x40
#define LIS2DH12_INT2_ZHIE_MASK           0x20
#define LIS2DH12_INT2_ZLIE_MASK           0x10
#define LIS2DH12_INT2_YHIE_MASK           0x08
#define LIS2DH12_INT2_YLIE_MASK           0x04
#define LIS2DH12_INT2_XHIE_MASK           0x02
#define LIS2DH12_INT2_XLIE_MASK           0x01

/**
* @brief  Interrupt 2 source register
*/
#define LIS2DH12_INT2_SRC_REG           0x35

#define LIS2DH12_INT2_IA_BIT            LIS2DH12_BIT(6)
#define LIS2DH12_INT2_ZH_BIT            LIS2DH12_BIT(5)
#define LIS2DH12_INT2_ZL_BIT            LIS2DH12_BIT(4)
#define LIS2DH12_INT2_YH_BIT            LIS2DH12_BIT(3)
#define LIS2DH12_INT2_YL_BIT            LIS2DH12_BIT(2)
#define LIS2DH12_INT2_XH_BIT            LIS2DH12_BIT(1)
#define LIS2DH12_INT2_XL_BIT            LIS2DH12_BIT(0)

#define LIS2DH12_INT2_IA_MASK           0x40
#define LIS2DH12_INT2_ZH_MASK           0x20
#define LIS2DH12_INT2_ZL_MASK           0x10
#define LIS2DH12_INT2_YH_MASK           0x08
#define LIS2DH12_INT2_YL_MASK           0x04
#define LIS2DH12_INT2_XH_MASK           0x02
#define LIS2DH12_INT2_XL_MASK           0x01

/**
* @brief   Interrupt 2 threshold register
*/
#define LIS2DH12_INT2_THS_REG           0x36
#define LIS2DH12_INT2_THS_BIT           LIS2DH12_BIT(0)
#define LIS2DH12_INT2_THS_MASK          0x7F

/**
* @brief  Interrupt 2 duration register
*/
#define LIS2DH12_INT2_DURATION_REG      0x37

#define LIS2DH12_INT2_DURATION_BIT      LIS2DH12_BIT(0)

#define LIS2DH12_INT2_DURATION_MASK     0x7F

/**
* @brief  Click config register
*/
#define LIS2DH12_CLICK_CFG_REG      0x38

#define LIS2DH12_ZD_BIT            LIS2DH12_BIT(5)
#define LIS2DH12_ZS_BIT            LIS2DH12_BIT(4)
#define LIS2DH12_YD_BIT            LIS2DH12_BIT(3)
#define LIS2DH12_YS_BIT            LIS2DH12_BIT(2)
#define LIS2DH12_XD_BIT            LIS2DH12_BIT(1)
#define LIS2DH12_XS_BIT            LIS2DH12_BIT(0)
#define LIS2DH12_ZD_MASK           0x20
#define LIS2DH12_ZS_MASK           0x10
#define LIS2DH12_YD_MASK           0x08
#define LIS2DH12_YS_MASK           0x04
#define LIS2DH12_XD_MASK           0x02
#define LIS2DH12_XS_MASK           0x01

/**
* @brief  Click source register
*/
#define LIS2DH12_CLICK_SRC_REG      0x39

#define LIS2DH12_CLICK_IA_BIT              LIS2DH12_BIT(6)
#define LIS2DH12_CLICK_DCLICK_BIT          LIS2DH12_BIT(5)
#define LIS2DH12_CLICK_SCLICK_BIT          LIS2DH12_BIT(4)
#define LIS2DH12_CLICK_SIGN_BIT            LIS2DH12_BIT(3)
#define LIS2DH12_CLICK_Z_BIT               LIS2DH12_BIT(2)
#define LIS2DH12_CLICK_Y_BIT               LIS2DH12_BIT(1)
#define LIS2DH12_CLICK_X_BIT               LIS2DH12_BIT(0)

#define LIS2DH12_CLICK_IA_MASK             0x40
#define LIS2DH12_CLICK_DCLICK_MASK         0x20
#define LIS2DH12_CLICK_SCLICK_MASK         0x10
#define LIS2DH12_CLICK_SIGN_MASK           0x08
#define LIS2DH12_CLICK_Z_MASK              0x04
#define LIS2DH12_CLICK_Y_MASK              0x02
#define LIS2DH12_CLICK_X_MASK              0x01

/**
* @brief  Click threshold register
*/
#define LIS2DH12_CLICK_THS_REG      0x3A
#define LIS2DH12_CLICK_LIR_BIT             LIS2DH12_BIT(7)
#define LIS2DH12_CLICK_THS_BIT             LIS2DH12_BIT(0)
#define LIS2DH12_CLICK_LIR_MASK            0x80
#define LIS2DH12_CLICK_THS_MASK            0x7F

/**
* @brief  Click time limit register
*/
#define LIS2DH12_TIME_LIMIT_REG      0x3B
#define LIS2DH12_TLI_BIT             LIS2DH12_BIT(0)
#define LIS2DH12_TLI_MASK            0x7F

/**
* @brief  Click time latency register
*/
#define LIS2DH12_TIME_LATENCY_REG      0x3C
#define LIS2DH12_TLA_BIT              LIS2DH12_BIT(0)
#define LIS2DH12_TLA_MASK             0xFF

/**
* @brief  Click time window register
*/
#define LIS2DH12_TIME_WINDOW_REG      0x3D
#define LIS2DH12_TW_BIT              LIS2DH12_BIT(0)
#define LIS2DH12_TW_MASK             0xFF

/**
* @brief  ACT threshold register
*/
#define LIS2DH12_ACT_THS_REG      0x3E
#define LIS2DH12_ACTH_BIT             LIS2DH12_BIT(0)
#define LIS2DH12_ACTH_MASK            0x7F

/**
* @brief  ACT duration register
*/
#define LIS2DH12_ACT_DUR_REG      0x3F
#define LIS2DH12_TW_BIT              LIS2DH12_BIT(0)
#define LIS2DH12_TW_MASK             0xFF

typedef void* lis2dh12_handle_t;

/**
 * @brief Write value to one register of LIS2DH12
 *
 * @param sensor object handle of LIS2DH12
 * @param reg_addr register address
 * @param data register value
 *
 * @return
 *     - ESP_OK Success
 *     - ESP_FAIL Fail
 */
esp_err_t iot_lis2dh12_write_byte(lis2dh12_handle_t sensor, uint8_t reg_addr, uint8_t data);

/**
 * @brief Write value to multiple register of LIS2DH12
 *
 * @param sensor object handle of LIS2DH12
 * @param reg_addr start address of register
 * @param data_buf register values
 *
 * @return
 *     - ESP_OK Success
 *     - ESP_FAIL Fail
 */
esp_err_t iot_lis2dh12_write(lis2dh12_handle_t sensor, uint8_t reg_start_addr, uint8_t reg_num, uint8_t *data_buf);

/**
 * @brief Read value from register of LIS2DH12
 *
 * @param sensor object handle of LIS2DH12
 * @param reg_addr register address
 * @param data register value
 *
 * @return
 *     - ESP_OK Success
 *     - ESP_FAIL Fail
 */
esp_err_t iot_lis2dh12_read_byte(lis2dh12_handle_t sensor, uint8_t reg, uint8_t *data);

/**
 * @brief Read value from multiple register of LIS2DH12
 *
 * @param sensor object handle of LIS2DH12
 * @param reg_addr start address of register
 * @param data_buf register values
 *
 * @return
 *     - ESP_OK Success
 *     - ESP_FAIL Fail
 */
esp_err_t iot_lis2dh12_read(lis2dh12_handle_t sensor, uint8_t reg_start_addr, uint8_t reg_num, uint8_t *data_buf);

/**
 * @brief Get device identification of LIS2DH12
 *
 * @param sensor object handle of LIS2DH12
 * @param deviceid a pointer of device ID
 *
 * @return
 *     - ESP_OK Success
 *     - ESP_FAIL Fail
 */
esp_err_t iot_lis2dh12_get_deviceid(lis2dh12_handle_t sensor, uint8_t* deviceid);

/**
 * @brief Set configration of LIS2DH12
 *
 * @param sensor object handle of LIS2DH12
 * @param lis2dh12_config a structure pointer of configration
 *
 * @return
 *     - ESP_OK Success
 *     - ESP_FAIL Fail
 */
esp_err_t iot_lis2dh12_set_config(lis2dh12_handle_t sensor, lis2dh12_config_t* lis2dh12_config);

/**
 * @brief Get configration of LIS2DH12
 *
 * @param sensor object handle of LIS2DH12
 * @param lis2dh12_config a structure pointer of configration
 *
 * @return
 *     - ESP_OK Success
 *     - others Fail
 */
esp_err_t iot_lis2dh12_get_config(lis2dh12_handle_t sensor, lis2dh12_config_t* lis2dh12_config);

/**
 * @brief Enable the temperature sensor of LIS2DH12
 *
 * @param sensor object handle of LIS2DH12
 * @param temp_en temperature enable status
 *
 * @return
 *     - ESP_OK Success
 *     - others Fail
 */
esp_err_t iot_lis2dh12_set_temp_enable(lis2dh12_handle_t sensor, lis2dh12_temp_en_t temp_en);

/**
 * @brief Set output data rate
 *
 * @param sensor object handle of LIS2DH12
 * @param odr output data rate value
 *
 * @return
 *     - ESP_OK Success
 *     - ESP_FAIL Fail
 */
esp_err_t iot_lis2dh12_set_odr(lis2dh12_handle_t sensor, lis2dh12_odr_t odr);

/**
 * @brief Enable z axis
 *
 * @param sensor object handle of LIS2DH12
 * @param status enable status
 *
 * @return
 *     - ESP_OK Success
 *     - ESP_FAIL Fail
 */
esp_err_t iot_lis2dh12_set_z_enable(lis2dh12_handle_t sensor, lis2dh12_state_t status);

/**
 * @brief Enable y axis
 *
 * @param sensor object handle of LIS2DH12
 * @param status enable status
 *
 * @return
 *     - ESP_OK Success
 *     - ESP_FAIL Fail
 */
esp_err_t iot_lis2dh12_set_y_enable(lis2dh12_handle_t sensor, lis2dh12_state_t status);

/**
 * @brief Enable x axis
 *
 * @param sensor object handle of LIS2DH12
 * @param status enable status
 *
 * @return
 *     - ESP_OK Success
 *     - ESP_FAIL Fail
 */
esp_err_t iot_lis2dh12_set_x_enable(lis2dh12_handle_t sensor, lis2dh12_state_t status);

/**
 * @brief Enable block data update
 *
 * @param sensor object handle of LIS2DH12
 * @param status enable status
 *
 * @return
 *     - ESP_OK Success
 *     - ESP_FAIL Fail
 */
esp_err_t iot_lis2dh12_set_bdumode(lis2dh12_handle_t sensor, lis2dh12_state_t status);

/**
 * @brief Set full scale
 *
 * @param sensor object handle of LIS2DH12
 * @param fs full scale  value
 *
 * @return
 *     - ESP_OK Success
 *     - ESP_FAIL Fail
 */
esp_err_t iot_lis2dh12_set_fs(lis2dh12_handle_t sensor, lis2dh12_fs_t fs);

/**
 * @brief Set operation mode
 *
 * @param sensor object handle of LIS2DH12
 * @param opt_mode operation mode
 *
 * @return
 *     - ESP_OK Success
 *     - ESP_FAIL Fail
 */
esp_err_t iot_lis2dh12_set_opt_mode(lis2dh12_handle_t sensor, lis2dh12_opt_mode_t opt_mode);

/**
 * @brief Get x axis acceleration
 *
 * @param sensor object handle of LIS2DH12
 * @param x_acc a poionter of x axis acceleration
 *
 * @return
 *     - ESP_OK Success
 *     - ESP_FAIL Fail
 */
esp_err_t iot_lis2dh12_get_x_acc(lis2dh12_handle_t sensor, uint16_t *x_acc);

/**
 * @brief Get y axis acceleration
 *
 * @param sensor object handle of LIS2DH12
 * @param y_acc a poionter of y axis acceleration
 *
 * @return
 *     - ESP_OK Success
 *     - ESP_FAIL Fail
 */
esp_err_t iot_lis2dh12_get_y_acc(lis2dh12_handle_t sensor, uint16_t *y_acc);
/**
 * @brief Get z axis acceleration
 *
 * @param sensor object handle of LIS2DH12
 * @param z_acc a poionter of z axis acceleration
 *
 * @return
 *     - ESP_OK Success
 *     - ESP_FAIL Fail
 */
esp_err_t iot_lis2dh12_get_z_acc(lis2dh12_handle_t sensor, uint16_t *z_acc);

/**
 * @brief Create and init sensor object and return a sensor handle
 *
 * @param bus I2C bus object handle
 * @param dev_addr I2C device address of sensor
 *
 * @return
 *     - NULL Fail
 *     - Others Success
 */
lis2dh12_handle_t iot_lis2dh12_create(i2c_bus_handle_t bus, uint16_t dev_addr);

/**
 * @brief Delete and release a sensor object
 *
 * @param sensor object handle of lis2dh12
 * @param del_bus Whether to delete the I2C bus
 *
 * @return
 *     - ESP_OK Success
 *     - ESP_FAIL Fail
 */
esp_err_t iot_lis2dh12_delete(lis2dh12_handle_t sensor, bool del_bus);

#ifdef __cplusplus
}
#endif

#ifdef __cplusplus
/**
 * class of lis2dh12 acceleration sensor
 */
class CLis2dh12
{
private:
    lis2dh12_handle_t m_sensor_handle;
    CI2CBus *bus;

    /**
     * prevent copy constructing
     */
    CLis2dh12(const CLis2dh12&);
    CLis2dh12& operator = (const CLis2dh12&);
public:
    /**
     * @brief Constructor of CLis2dh12 class
     * @param p_i2c_bus pointer to CI2CBus object
     * @param addr slave device address
     */
    CLis2dh12(CI2CBus *p_i2c_bus, uint8_t addr = LIS2DH12_I2C_ADDRESS);

    /**
     * @brief Destructor of CLis2dh12 class
     */
    ~CLis2dh12();

    /**
     * @brief Read device ID
     * @return device ID
     */
    uint8_t id();

    /**
     * @brief get acceleration on x-axis
     * @return acceleration on x-axis
     */
    uint16_t ax();

    /**
     * @brief get acceleration on y-axis
     * @return acceleration on y-axis
     */
    uint16_t ay();

    /**
     * @brief get acceleration on z-axis
     * @return acceleration on z-axis
     */
    uint16_t az();
};
#endif
#endif
